[
    {
        "id": "0",
        "content": "SDN technology is currently available for industrial control applications that require extremely fast failover, called Operational Technology (OT) Software Defined Networking (SDN).  OT SDN technology is an approach to manage network access control and Ethernet packet delivery on environmentally hardened hardware for critical infrastructure networks. OT SDN abstracts the management of the control plane from the switches centralizing it in the flow controller and applies SDN as the underlay control plane in the switch. The legacy control plane is removed simplifying the switch while centralizing the control plane management. The common control plane standard used in OT SDN is OpenFlow making it interoperable with other SDN solutions with the difference being that OpenFlow is the only control plane in the switch and that the switch retains flows through power cycles and all flows and redundancy are proactively traffic engineered so the switches can perform the forwarding they are configured to perform with or without the flow controller online. OT SDN provides advantages for industrial networks in the form of performance, cybersecurity and situational awareness. Performance advantages are achieved through proactively traffic engineering contingencies using Fast Failover groups in OpenFlow resulting in network healing from link or switch failures in microseconds not milliseconds like spanning tree technology.  Another performance advantage is that loop mitigation is done through traffic engineered path planning and not blocked ports allowing the system owner to actively use all ports. Cybersecurity advantages of OT SDN is that the switches are deny by default and flows are the rules that allow traffic to be forwarded. This provides strong network access control where packets can be inspected from layer 1 through layer 4 of the OSI model at each hop. Legacy control plane security vulnerabilities are removed since the legacy control plane no longer exists. MAC table spoofing and BPDU spoofing are no longer possible because neither exist in the OT SDN switches. Pivoting and network reconnaissance no longer work with proper flow programming as only allowed traffic is approved to be forwarded combining the physical location and path with the virtual packet filtering. Situational awareness advantages of OT SDN provide the network owner with the visibility to what devices are on their network and what conversations can and are happening and who those conversations can happen between.  OT SDN network technology allows Ethernet networks to meet the demanding communication message exchange requirements of measurement and control for critical infrastructure and simply provides the system owner control over what devices can connect to the network, where those devices can connect, and what conversations each device can have.",
        "keywords": [
            "network",
            "packet",
            "system",
            "message",
            "SDN",
            "communication",
            "security",
            "technology",
            "port",
            "device",
            "switch"
        ]
    },
    {
        "id": "1",
        "content": "ADSL quickly replaced ISDN as the customer-facing solution for last-mile connectivity. ISDN has largely disappeared on the customer side, remaining in use only in niche roles like dedicated teleconferencing systems and similar legacy systems.",
        "keywords": [
            "system",
            "SDN"
        ]
    },
    {
        "id": "2",
        "content": "Several different information sources may provide information about a route to a given destination, but the router must select the \"best\" route to install into the routing table. In some cases, there may be multiple routes of equal \"quality\", and the router may install all of them and load-share across them.",
        "keywords": []
    },
    {
        "id": "3",
        "content": "Segmentation involves the use of a switch to split a larger collision domain into smaller ones in order to reduce collision probability and to improve overall network throughput. In the extreme case (i.e. micro-segmentation), each device is located on a dedicated switch port. In contrast to an Ethernet hub, there is a separate collision domain on each of the switch ports. This allows computers to have dedicated bandwidth on point-to-point connections to the network and also to run in full-duplex mode. Full-duplex mode has only one transmitter and one receiver per collision domain, making collisions impossible.",
        "keywords": [
            "network",
            "port",
            "computer",
            "connection",
            "device",
            "switch"
        ]
    },
    {
        "id": "4",
        "content": "For the fiscal year 2018, Cisco reported earnings of US$0.1 billion, with an annual revenue of US$49.3 billion, an increase of 2.8% over the previous fiscal cycle. Cisco's shares traded at over $43 per share, and its market capitalization was valued at US$213.2 billion in September 2018. Low Net Income for fiscal year 2018 was attributed to a one-time tax charge, that allowed Cisco to bring back capital from overseas. Cisco used this money it was able to bring back at a lower tax rate to fund share buybacks and acquisitions.",
        "keywords": [
            "port",
            "time"
        ]
    },
    {
        "id": "5",
        "content": "Initially, network virtualization only involved the separation of the control plane and the forwarding plane (management and packet transmission) within networking devices like switches. This has shifted to include the totality of virtualizing a network, including how the network is programmed, administered, and deployed, be it hardware, software, or management and packet transmission.",
        "keywords": [
            "network",
            "packet",
            "device",
            "switch",
            "software"
        ]
    },
    {
        "id": "6",
        "content": "WANs were very important for the development of networking technologies in general and were for a long time the most important application of networks both for military and enterprise applications. The ability to communicate data over large distances was one of the main driving factors for the development of data communications technologies, as it made it possible to overcome the distance limitations, as well as shortening the time necessary to exchange messages with other parties.",
        "keywords": [
            "network",
            "data",
            "message",
            "communication",
            "port",
            "time"
        ]
    },
    {
        "id": "7",
        "content": "Wow, if this is Nick Feamster, author of \"The Road to SDN: An intellectual history...\", I really like y'all's paper! I think that the perspective of SDN as one application of programmable network is important to the continuity of SDN research momentum, and including links to Active Networking will help, as you say, bring this research full circle.  Please, crack away. :D",
        "keywords": [
            "network",
            "SDN",
            "port"
        ]
    },
    {
        "id": "8",
        "content": "Wow, if this is Nick Feamster, author of \"The Road to SDN: An intellectual history...\", I really like y'all's paper! I think that the perspective of SDN as one application of programmable network is important to the continuity of SDN research momentum, and including links to Active Networking will help, as you say, bring this research full circle.  Please, crack away. :D",
        "keywords": [
            "network",
            "SDN",
            "port"
        ]
    },
    {
        "id": "9",
        "content": "The ONF launched a continuous certification program for products and equipment in the telecom and networking space. As part of certification, the Open Compute Project (OCP) is collaborating with ONF in this new program to promote the use of OCP-recognized open hardware in ONF solutions.",
        "keywords": [
            "network"
        ]
    },
    {
        "id": "10",
        "content": "Avaya enterprise customers include: Apple, AT&T, Dell, CVS Health, Liberty Mutual Insurance, Disney, Comcast, Walmart, Deutsche Telekom, Lloyds Banking Group, Standard Chartered Bank, Michigan State University, UC Berkeley, U.S. House of Representatives",
        "keywords": []
    },
    {
        "id": "11",
        "content": "Shortest Path Bridging - VID (SPBV) and Shortest Path Bridging - MAC (SPBM) are two operating modes of 802.1aq, and are described in more detail below.  Both inherit key benefits of link state routing:",
        "keywords": []
    },
    {
        "id": "12",
        "content": "As it is easy to generate MD5 collisions, it is possible for the person who created the file to create a second file with the same checksum, so this technique cannot protect against some forms of malicious tampering. In some cases, the checksum cannot be trusted (for example, if it was obtained over the same channel as the downloaded file), in which case MD5 can only provide error-checking functionality: it will recognize a corrupt or incomplete download, which becomes more likely when downloading larger files.",
        "keywords": []
    },
    {
        "id": "13",
        "content": "The vulnerable hashing functions work by taking the input message, and using it to transform an internal state.  After all of the input has been processed, the hash digest is generated by outputting the internal state of the function.  It is possible to reconstruct the internal state from the hash digest, which can then be used to process the new data.  In this way, one may extend the message and compute the hash that is a valid signature for the new message.",
        "keywords": [
            "data",
            "message"
        ]
    },
    {
        "id": "14",
        "content": "Hash functions and their associated hash tables are used in data storage and retrieval applications to access data in a small and nearly constant time per retrieval, and require an amount of storage space only fractionally greater than the total space required for the data or records themselves.  Hashing is a computationally and storage space efficient form of data access which avoids the non-linear access time of ordered and unordered lists and structured trees, and the often exponential storage requirements of direct access of state spaces of large or variable-length keys.",
        "keywords": [
            "data",
            "time"
        ]
    },
    {
        "id": "15",
        "content": "Both physical and logical integrity often share many common challenges such as human errors and design flaws, and both must appropriately deal with concurrent requests to record and retrieve data, the latter of which is entirely a subject on its own.",
        "keywords": [
            "data"
        ]
    },
    {
        "id": "16",
        "content": "Even though some proofs of complexity-theoretic theorems regularly assume some concrete choice of input encoding, one tries to keep the discussion abstract enough to be independent of the choice of encoding. This can be achieved by ensuring that different representations can be transformed into each other efficiently.",
        "keywords": []
    },
    {
        "id": "17",
        "content": "A compression function mixes two fixed length inputs and produces a single fixed length output of the same size as one of the inputs. This can also be seen as that the compression function transforms one large fixed-length input into a shorter, fixed-length output.",
        "keywords": []
    },
    {
        "id": "18",
        "content": "The original RIPEMD, as well as RIPEMD-128, is not considered secure because 128-bit result is too small and also (for the original RIPEMD) because of design weaknesses. The 256- and 320-bit versions of RIPEMD provide the same level of security as RIPEMD-128 and RIPEMD-160, respectively; they are designed for applications where the security level is sufficient but longer hash result is necessary.",
        "keywords": [
            "IP",
            "security"
        ]
    },
    {
        "id": "19",
        "content": "In most jurisdictions the copyright holder must bear the cost of enforcing copyright. This will usually involve engaging legal representation, administrative or court costs. In light of this, many copyright disputes are settled by a direct approach to the infringing party in order to settle the dispute out of court.",
        "keywords": []
    },
    {
        "id": "20",
        "content": "The Internet has brought new opportunities for copywriters to learn their craft, do research and view others' work. Clients, copywriters and art directors can more readily find each other, making freelancing a viable job option. There are also many new websites that make becoming a freelance copywriter a much more organized process.",
        "keywords": [
            "Internet",
            "port"
        ]
    },
    {
        "id": "21",
        "content": "GNU is not in the public domain. Everyone will be permitted to modify and redistribute GNU, but no distributor will be allowed to restrict its further redistribution. That is to say, proprietary modifications will not be allowed. I want to make sure that all versions of GNU remain free.",
        "keywords": []
    },
    {
        "id": "22",
        "content": "Under a bill proposed by the government of Chancellor Angela Merkel approved by the Bundestag, Germany infringement of copyright is equivalent to the crime of theft. The prison sentences for violations of copyright, exactly equal to those provided for the theft, are five years in prison and are the strictest in Europe. For the offense may be indicted even children under 18 years. In addition, following the judgment of 20 October 1993 on the case Phil Collins, it was launched Article 12 (in the Treaty establishing the European Community), according to which states cannot discriminate against goods from other countries.",
        "keywords": []
    },
    {
        "id": "23",
        "content": "Database rights last for 15 years. Each time a database is substantially modified, however, a new set of rights are created for that database. An owner has the right to object to the copying of substantial parts of their database, even if data is extracted and reconstructed piecemeal. Database rights under the EU are created automatically, vested in the employers of creators (when the action of creation was part of employment), and do not have to be registered to have effect.",
        "keywords": [
            "data",
            "time"
        ]
    },
    {
        "id": "24",
        "content": "The International Treaty on Plant Genetic Resources for Food and Agriculture was open to accession a year after adoption and once closed to signatures (Article 27), i.e., on 4 November 2002. 77 countries and the European Union had signed the treaty by that date.",
        "keywords": []
    },
    {
        "id": "25",
        "content": "The long-term goal is to actually have a legal system, and certainly a treaty could do that, that acknowledges two things.  Number one, it acknowledges that indigenous peoples are peoples with a right to self-determination that includes governance rights over all property belonging to the indigenous people. And, number two, it acknowledges that indigenous cultural expressions are a form of intellectual property and that traditional knowledge is a form of intellectual property, but they are collective resources – so not any one individual can give away the rights to those resources. The tribal nations actually own them collectively.",
        "keywords": [
            "system"
        ]
    },
    {
        "id": "26",
        "content": "According to industrial property Act 2001, an industrial design is defined as \"any composition of lines or colours or any three-dimensional form whether or not associated with lines or colours, provided that such composition or form gives a special appearance to a product of industry or handicraft and can serve as pattern for a product of industry or handicraft\" .",
        "keywords": []
    },
    {
        "id": "27",
        "content": "The inventors, their successors or their assignees become the proprietors of the patent when and if it is granted. If a patent is granted to more than one proprietor, the laws of the country in question and any agreement between the proprietors may affect the extent to which each proprietor can exploit the patent. For example, in some countries, each proprietor may freely license or assign their rights in the patent to another person while the law in other countries prohibits such actions without the permission of the other proprietor(s).",
        "keywords": []
    },
    {
        "id": "28",
        "content": "The total combined duration of market exclusivity of a general patent and SPC cannot normally exceed 15 years. However, the reward of a 6-month SPC extension for the submission of data from an agreed PIP can extend this combined duration to 15.5 years.",
        "keywords": [
            "data",
            "IP"
        ]
    },
    {
        "id": "29",
        "content": "Any person who, on or in connection with any goods or services, or any container for goods, uses in commerce any word, term, name, symbol, or device, or any combination thereof, or any false designation of origin, false or misleading description of fact, or false or misleading representation of fact, which",
        "keywords": [
            "service",
            "connection",
            "device"
        ]
    },
    {
        "id": "30",
        "content": "The precise language by which a trade secret is defined varies by jurisdiction, as do the particular types of information that are subject to trade secret protection. Three factors are common to all such definitions:",
        "keywords": []
    },
    {
        "id": "31",
        "content": "Definitions of \"abandoned\" vary, but in general it is like any item that is abandoned – it is ignored by the owner, and as such product support and possibly copyright enforcement are also \"abandoned\".",
        "keywords": [
            "port"
        ]
    },
    {
        "id": "32",
        "content": "With the publication of FIPS PUB 180-2, NIST added three additional hash functions in the SHA family. The algorithms are collectively known as SHA-2, named after their digest lengths (in bits): SHA-256, SHA-384, and SHA-512.",
        "keywords": [
            "IP"
        ]
    },
    {
        "id": "33",
        "content": "Paul Crowley, a cryptographer and senior developer at an independent software development company, expressed his support of the decision, saying that Keccak is supposed to be tunable and there is no reason for different security levels within one primitive. He also added:",
        "keywords": [
            "security",
            "port",
            "software"
        ]
    },
    {
        "id": "34",
        "content": "NESSIE was intended to identify and evaluate quality cryptographic designs in several categories, and to that end issued a public call for submissions in March 2000. Forty-two were received, and in February 2003 twelve of the submissions were selected. In addition, five algorithms already publicly known, but not explicitly submitted to the project, were chosen as \"selectees\". The project has publicly announced that \"no weaknesses were found in the selected designs\".",
        "keywords": []
    },
    {
        "id": "35",
        "content": "A compression function mixes two fixed length inputs and produces a single fixed length output of the same size as one of the inputs. This can also be seen as that the compression function transforms one large fixed-length input into a shorter, fixed-length output.",
        "keywords": []
    },
    {
        "id": "36",
        "content": "The aim of SLM is to display the IT security status transparently across a company at any time, and to make IT security a measurable quantity. Transparency and measurability form the prerequisites for making IT security proactively monitorable, so that it can be improved continuously.",
        "keywords": [
            "security",
            "time"
        ]
    },
    {
        "id": "37",
        "content": "The following hash function submissions were accepted for Round Two, but did not make it to the final round. As noted in the announcement of the finalists, \"none of these candidates was clearly broken\".",
        "keywords": []
    },
    {
        "id": "38",
        "content": "The TLS protocol aims primarily to provide privacy and data integrity between two or more communicating computer applications. It runs in the application layer of the Internet and is itself composed of two layers: the TLS record and the TLS handshake protocols.",
        "keywords": [
            "data",
            "protocol",
            "Internet",
            "computer"
        ]
    },
    {
        "id": "39",
        "content": "The TLS protocol aims primarily to provide privacy and data integrity between two or more communicating computer applications. It runs in the application layer of the Internet and is itself composed of two layers: the TLS record and the TLS handshake protocols.",
        "keywords": [
            "data",
            "protocol",
            "Internet",
            "computer"
        ]
    },
    {
        "id": "40",
        "content": "Before a client attempts to connect with a server, the server must first bind to and listen at a port to open it up for connections: this is called a passive open. Once the passive open is established, a client may establish a connection by initiating an active open using the three-way (or 3-step) handshake:",
        "keywords": [
            "server",
            "port",
            "client",
            "connection"
        ]
    },
    {
        "id": "41",
        "content": "The literature presents numerous analogies between computer communication and programming. In analogy, a transfer mechanism of a protocol is comparable to a central processing unit (CPU). The framework introduces rules that allow the programmer to design cooperating protocols independently of one another.",
        "keywords": [
            "protocol",
            "communication",
            "computer"
        ]
    },
    {
        "id": "42",
        "content": "In 1975, a two-network TCP/IP communications test was performed between Stanford and University College London. In November 1977, a three-network TCP/IP test was conducted between sites in the US, the UK, and Norway. Several other TCP/IP prototypes were developed at multiple research centers between 1978 and 1983.",
        "keywords": [
            "network",
            "IP",
            "communication"
        ]
    },
    {
        "id": "43",
        "content": "Usually, when the transmitter does not receive the acknowledgment before the timeout occurs (i.e., within a reasonable amount of time after sending the data frame), it retransmits the frame until it is either correctly received or the error persists beyond a predetermined number of retransmissions.",
        "keywords": [
            "data",
            "time"
        ]
    },
    {
        "id": "44",
        "content": "The computer receiving the HTTP request delivers it to web server software listening for requests on port 80. If the web server can fulfil the request it sends an HTTP response back to the browser indicating success:",
        "keywords": [
            "server",
            "port",
            "HTTP",
            "computer",
            "software"
        ]
    },
    {
        "id": "45",
        "content": "Video latency refers to the degree of delay between the time a transfer of a video stream is requested and the actual time that transfer begins. Networks that exhibit relatively small delays are known as low-latency networks, while their counterparts are known as high-latency networks.",
        "keywords": [
            "network",
            "time"
        ]
    },
    {
        "id": "46",
        "content": "When a sender receives three duplicate acknowledgements, it can be reasonably confident that the segment carrying the data that followed the last in-order byte specified in the acknowledgment was lost. A sender with fast retransmit will then retransmit this packet immediately without waiting for its timeout. On receipt of the retransmitted segment, the receiver can acknowledge the last in-order byte of data received. In the above example, this would acknowledge to the end of the payload of the fifth packet. There is no need to acknowledge intermediate packets, since TCP uses cumulative acknowledgements by default.",
        "keywords": [
            "data",
            "packet",
            "time"
        ]
    },
    {
        "id": "47",
        "content": "If an attacker can cause delivery of counterfeit packets of this sort, he or she may be able to cause various sorts of mischief, including the injection into an existing TCP connection of data of the attacker's choosing, and the premature closure of an existing TCP connection by the injection of counterfeit packets with the RST bit set.",
        "keywords": [
            "data",
            "packet",
            "connection"
        ]
    },
    {
        "id": "48",
        "content": "TCP is used with IP when a two-way virtual connection is required between two computers. (UDP on the other hand is a connectionless IP protocol.)\nTCP software on the two machines which will communicate (for example a workstation with a browser and a web server) by exchanging a stream of packets. Using a TCP connection gives the computers an easy way to exchange data items too big for a single packet, such as video clips, email attachments, or music files. Although some web pages are small enough for a single packet, they are sent over TCP connections for convenience.",
        "keywords": [
            "data",
            "IP",
            "packet",
            "protocol",
            "server",
            "computer",
            "connection",
            "software"
        ]
    },
    {
        "id": "49",
        "content": "The first state is the Idle state. In the Idle state, BGP initializes all resources, refuses all inbound BGP connection attempts and initiates a TCP connection to the peer. The second state is Connect. In the Connect state, the router waits for the TCP connection to complete and transitions to the OpenSent state if successful. If unsuccessful, it starts the ConnectRetry timer and transitions to the Active state upon expiration. In the Active state, the router resets the ConnectRetry timer to zero and returns to the Connect state. In the OpenSent state, the router sends an Open message and waits for one in return in order to transition to the OpenConfirm state. Keepalive messages are exchanged and, upon successful receipt, the router is placed into the Established state. In the Established state, the router can send and receive: Keepalive; Update; and Notification messages to and from its peer.",
        "keywords": [
            "message",
            "time",
            "connection"
        ]
    },
    {
        "id": "50",
        "content": "On large networks that consist of multiple links, a single DHCP server may service the entire network when aided by DHCP relay agents located on the interconnecting routers. Such agents relay messages between DHCP clients and DHCP servers located on different subnets.",
        "keywords": [
            "network",
            "server",
            "message",
            "service",
            "client"
        ]
    },
    {
        "id": "51",
        "content": "Note these data types are commonly called \"modes\", although ambiguously that word is also used to refer to active-vs-passive communication mode (see above), and the modes set by the FTP protocol MODE command (see below).",
        "keywords": [
            "data",
            "protocol",
            "communication"
        ]
    },
    {
        "id": "52",
        "content": "MGCP presents a call control architecture with limited intelligence at the edge (endpoints, media gateways) and intelligence at the core controllers. The MGCP model assumes that call agents synchronize with each other to send coherent commands and responses to the gateways under their control.",
        "keywords": []
    },
    {
        "id": "53",
        "content": "When a publishing client first connects to the broker, it can set up a default message to be sent to subscribers if the broker detects that the publishing client has unexpectedly disconnected from the broker.",
        "keywords": [
            "message",
            "client"
        ]
    },
    {
        "id": "54",
        "content": "A simplified PTP system frequently consists of ordinary clocks connected to a single network, and no boundary clocks are used. A grandmaster is elected and all other clocks synchronize directly to it.",
        "keywords": [
            "network",
            "system"
        ]
    },
    {
        "id": "55",
        "content": "A proxy server is a network server with UAC and UAS components that functions as an intermediary entity for the purpose of performing requests on behalf of other network elements. A proxy server primarily plays the role of call routing; it sends SIP requests to another entity closer to it destination. Proxies are also useful for enforcing policy, such as for determining whether a user is allowed to make a call. A proxy interprets, and, if necessary, rewrites specific parts of a request message before forwarding it.",
        "keywords": [
            "network",
            "IP",
            "server",
            "message"
        ]
    },
    {
        "id": "56",
        "content": "This system has several variations. For example, an organisation's SMTP server may only provide service to users on the same network, enforcing this by firewalling to block access by users on the wider Internet. Or the server may perform range checks on the client's IP address. These methods were typically used by corporations and institutions such as universities which provided an SMTP server for outbound mail only for use internally within the organisation. However, most of these bodies now use client authentication methods, as described below.",
        "keywords": [
            "network",
            "IP",
            "server",
            "system",
            "Internet",
            "service",
            "client"
        ]
    },
    {
        "id": "57",
        "content": "Three significant versions of SNMP have been developed and deployed. SNMPv1 is the original version of the protocol. More recent versions, SNMPv2c and SNMPv3, feature improvements in performance, flexibility and security.",
        "keywords": [
            "protocol",
            "security"
        ]
    },
    {
        "id": "58",
        "content": "It is of note that there are a large number of industrial and scientific devices which have only Telnet available as a communication option.  Some are built with only a standard RS-232 port and use a serial server hardware appliance to provide the translation between the TCP/Telnet data and the RS-232 serial data.  In such cases, SSH is not an option unless the interface appliance can be configured for SSH.",
        "keywords": [
            "data",
            "server",
            "communication",
            "port",
            "device"
        ]
    },
    {
        "id": "59",
        "content": "Before a client attempts to connect with a server, the server must first bind to and listen at a port to open it up for connections: this is called a passive open. Once the passive open is established, a client may establish a connection by initiating an active open using the three-way (or 3-step) handshake:",
        "keywords": [
            "server",
            "port",
            "client",
            "connection"
        ]
    },
    {
        "id": "60",
        "content": "ICMP uses the basic support of IP as if it were a higher-level protocol, however, ICMP is actually an integral part of IP. Although ICMP messages are contained within standard IP packets, ICMP messages are usually processed as a special case, distinguished from normal IP processing. In many cases, it is necessary to inspect the contents of the ICMP message and deliver the appropriate error message to the application responsible for transmitting the IP packet that prompted the ICMP message to be sent.",
        "keywords": [
            "IP",
            "packet",
            "protocol",
            "message",
            "ICMP",
            "port"
        ]
    },
    {
        "id": "61",
        "content": "Conventionally, TCP/IP networks signal congestion by dropping packets.  When ECN is successfully negotiated, an ECN-aware router may set a mark in the IP header instead of dropping a packet in order to signal impending congestion.  The receiver of the packet echoes the congestion indication to the sender, which reduces its transmission rate as if it detected a dropped packet.",
        "keywords": [
            "network",
            "IP",
            "packet"
        ]
    },
    {
        "id": "62",
        "content": "The link layer in the TCP/IP model is a descriptive realm of networking protocols that operate only on the local network segment (link) that a host is connected to. Such protocol packets are not routed to other networks. The link layer includes the protocols that define communication between local (on-link) network nodes which fulfill the purpose of maintaining link states between the local nodes, such as the local network topology, and that usually use protocols that are based on the framing of packets specific to the link types.",
        "keywords": [
            "network",
            "IP",
            "packet",
            "protocol",
            "communication"
        ]
    },
    {
        "id": "63",
        "content": "The principal packet structure of ARP packets is shown in the following table which illustrates the case of IPv4 networks running on Ethernet. In this scenario, the packet has 48-bit fields for the sender hardware address (SHA) and target hardware address (THA), and 32-bit fields for the corresponding sender and target protocol addresses (SPA and TPA). The ARP packet size in this case is 28 bytes.",
        "keywords": [
            "network",
            "IP",
            "packet",
            "protocol"
        ]
    },
    {
        "id": "64",
        "content": "Equipment frequently support multiple versions of Wi-Fi. To communicate, devices must use a common Wi-Fi version. The versions differ between the radio wavebands they operate on, the radio bandwidth they occupy, the maximum data rates they can support and other details. Some versions permit the use of multiple antennas, which permits greater speeds as well as reduced interference.",
        "keywords": [
            "data",
            "antenna",
            "port",
            "device"
        ]
    },
    {
        "id": "65",
        "content": "FDDI requires this network topology because the dual ring actually passes through each connected device and requires each such device to remain continuously operational.\nThe standard actually allows for optical bypasses, but network engineers consider these unreliable and error-prone. Devices such as workstations and minicomputers that might not come under the control of the network managers are not suitable for connection to the dual ring.",
        "keywords": [
            "network",
            "computer",
            "connection",
            "device"
        ]
    },
    {
        "id": "66",
        "content": "The most prominent component of the Internet model is the Internet Protocol (IP). IP enables internetworking and, in essence, establishes the Internet itself. Two versions of the Internet Protocol exist, IPV4 and IPV6.",
        "keywords": [
            "network",
            "IP",
            "Internet"
        ]
    },
    {
        "id": "67",
        "content": "Early network design, when global end-to-end connectivity was envisioned for communications with all Internet hosts, intended that IP addresses be globally unique. However, it was found that this was not always necessary as private networks developed and public address space needed to be conserved.",
        "keywords": [
            "network",
            "IP",
            "Internet",
            "communication"
        ]
    },
    {
        "id": "68",
        "content": "ICMP uses the basic support of IP as if it were a higher-level protocol, however, ICMP is actually an integral part of IP. Although ICMP messages are contained within standard IP packets, ICMP messages are usually processed as a special case, distinguished from normal IP processing. In many cases, it is necessary to inspect the contents of the ICMP message and deliver the appropriate error message to the application responsible for transmitting the IP packet that prompted the ICMP message to be sent.",
        "keywords": [
            "IP",
            "packet",
            "protocol",
            "message",
            "ICMP",
            "port"
        ]
    },
    {
        "id": "69",
        "content": "The literature presents numerous analogies between computer communication and programming. In analogy, a transfer mechanism of a protocol is comparable to a central processing unit (CPU). The framework introduces rules that allow the programmer to design cooperating protocols independently of one another.",
        "keywords": [
            "protocol",
            "communication",
            "computer"
        ]
    },
    {
        "id": "70",
        "content": "Additionally, the political and defense communities recognized the need for a high-level Department of Defense organization to formulate and execute R&D projects that would expand the frontiers of technology beyond the immediate and specific requirements of the Military Services and their laboratories. In pursuit of this mission, DARPA has developed and transferred technology programs encompassing a wide range of scientific disciplines that address the full spectrum of national security needs.",
        "keywords": [
            "security",
            "technology"
        ]
    },
    {
        "id": "71",
        "content": "In RFC 3, which first defined the RFC series, Crocker started attributing the RFC series to the Network Working Group. Rather than being a formal committee, it was a loose association of researchers interested in the ARPANET project. In effect, it included anyone who wanted to join the meetings and discussions about the project.",
        "keywords": []
    },
    {
        "id": "72",
        "content": "Networking devices includes a broad range of equipment which can be classified as core network components which interconnect other network components, hybrid components which can be found in the core or border of a network and hardware or software components which typically sit on the connection point of different networks.",
        "keywords": [
            "network",
            "connection",
            "device",
            "software"
        ]
    },
    {
        "id": "73",
        "content": "In cases of no response from the target host, most implementations display either nothing or periodically print notifications about timing out. Possible ping results indicating a problem include the following:",
        "keywords": []
    },
    {
        "id": "74",
        "content": "The sender expects a reply within a specified number of seconds. If a packet is not acknowledged within the expected interval, an asterisk is displayed. The Internet Protocol does not require packets to take the same route towards a particular destination, thus hosts listed might be hosts that other packets have traversed. If the host at hop #N does not reply, the hop is skipped in the output.",
        "keywords": [
            "packet",
            "Internet"
        ]
    },
    {
        "id": "75",
        "content": "The units used are seconds. An older common TTL value for DNS was 86400 seconds, which is 24 hours. A TTL value of 86400 would mean that, if a DNS record was changed on the authoritative nameserver, DNS servers around the world could still be showing the old value from their cache for up to 24 hours after the last update by client.",
        "keywords": [
            "server",
            "client"
        ]
    },
    {
        "id": "76",
        "content": "When the receiver assembles all IP fragments, it will end up with an IP packet which is larger than 65,535 bytes. This may possibly overflow memory buffers which the receiver allocated for the packet, and can cause various problems.",
        "keywords": [
            "IP",
            "packet"
        ]
    },
    {
        "id": "77",
        "content": "ICMP tunneling works by injecting arbitrary data into an echo packet sent to a remote computer.  The remote computer replies in the same manner, injecting an answer into another ICMP packet and sending it back.  The client performs all communication using ICMP echo request packets, while the proxy uses echo reply packets.",
        "keywords": [
            "data",
            "packet",
            "ICMP",
            "communication",
            "client",
            "computer"
        ]
    },
    {
        "id": "78",
        "content": "While a deprecated software feature remains in the software, its use may raise warning messages recommending alternative practices. Deprecated status may also indicate the feature will be removed in the future. Features are deprecated, rather than immediately removed, to provide backward compatibility and to give programmers time to bring affected code into compliance with the new standard.",
        "keywords": [
            "message",
            "time",
            "software"
        ]
    },
    {
        "id": "79",
        "content": "In practice, only the IP Precedence part of the field was ever used outside US DoD networks: the higher the value of the IP Precedence field, the higher the priority of the IP packet. Some US DoD networks did use the delay bit for route selection between oceanic cable paths and Satellite Communication (SATCOM) paths when both paths existed. IPv6 has never had an IPv4-like \"traditional\" ToS field, partially because the authors were aware of DiffServ efforts at its drafting (RFC 2460 Section 7).",
        "keywords": [
            "network",
            "IP",
            "packet"
        ]
    },
    {
        "id": "80",
        "content": "ICMP uses the basic support of IP as if it were a higher-level protocol, however, ICMP is actually an integral part of IP. Although ICMP messages are contained within standard IP packets, ICMP messages are usually processed as a special case, distinguished from normal IP processing. In many cases, it is necessary to inspect the contents of the ICMP message and deliver the appropriate error message to the application responsible for transmitting the IP packet that prompted the ICMP message to be sent.",
        "keywords": [
            "IP",
            "packet",
            "protocol",
            "message",
            "ICMP",
            "port"
        ]
    },
    {
        "id": "81",
        "content": "Skip is hybrid Key distribution protocol \nSimple Key Management for Internet Protocols (SKIP) is similar to SSL, except that it establishes a long-term key once, and then requires no prior communication in order to establish or exchange keys on a session-by-session basis. Therefore, no connection setup overhead exists and new keys values are not continually generated.\nSKIP uses the knowledge of its own secret key or private component and the destination's public component to calculate a unique key that can only be used between them.",
        "keywords": [
            "IP",
            "protocol",
            "Internet",
            "communication",
            "connection"
        ]
    },
    {
        "id": "82",
        "content": "A similar idea is currently used by 3GPP SON protocol (aka ANR) for discovering candidate access points. However, ANR protocol extends RRC and X2 protocols to support CARD-like functionality for L2 network.",
        "keywords": [
            "network",
            "protocol",
            "port"
        ]
    },
    {
        "id": "83",
        "content": "Equipment frequently support multiple versions of Wi-Fi. To communicate, devices must use a common Wi-Fi version. The versions differ between the radio wavebands they operate on, the radio bandwidth they occupy, the maximum data rates they can support and other details. Some versions permit the use of multiple antennas, which permits greater speeds as well as reduced interference.",
        "keywords": [
            "data",
            "antenna",
            "port",
            "device"
        ]
    },
    {
        "id": "84",
        "content": "Smart devices are typically composed of a hardware layer (including a radio that transmits signals), a network layer (through which devices communicate with each other), and an application layer (through which end users deliver commands). These layers often include the following characteristics:",
        "keywords": [
            "network",
            "device"
        ]
    },
    {
        "id": "85",
        "content": "Consider a half-wave dipole designed to work with signals with wavelength  1 m, meaning the antenna would be approximately 50 cm from tip to tip. If the element has a length-to-diameter ratio of 1000, it will have an inherent impedance of about 63 ohms resistive. Using the appropriate transmission wire or balun, we match that resistance to ensure minimum signal reflection. Feeding that antenna with a current of 1 Ampere will require 63 Volts, and the antenna will radiate 63 Watts (ignoring losses) of radio frequency power. Now consider the case when the antenna is fed a signal with a wavelength of 1.25 m; in this case the current induced by the signal would arrive at the antenna's feedpoint out-of-phase with the signal, causing the net current to drop while the voltage remains the same. Electrically this appears to be a very high impedance. The antenna and transmission line no longer have the same impedance, and the signal will be reflected back into the antenna, reducing output. This could be addressed by changing the matching system between the antenna and transmission line, but that solution only works well at the new design frequency.",
        "keywords": [
            "system",
            "antenna"
        ]
    },
    {
        "id": "86",
        "content": "In the early days of radio, the thus-named Marconi antenna (monopole) and the doublet (dipole) were seen as distinct inventions. Now, however, the \"monopole\" antenna is understood as a special case of a dipole which has a virtual element \"underground\".",
        "keywords": [
            "antenna"
        ]
    },
    {
        "id": "87",
        "content": "With lower frequencies, C-band for example, dish designers have a wider choice of materials.  The large size of dish required for lower frequencies led to the dishes being constructed from metal mesh on a metal framework.  At higher frequencies, mesh type designs are rarer though some designs have used a solid dish with perforations.",
        "keywords": []
    },
    {
        "id": "88",
        "content": "Multi-band operation is possible with coils at about one-half or one-third and two-thirds that do not affect the aerial much at the lowest band, but it creates the effect of stacked dipoles at a higher band (usually ×2 or ×3 frequency).",
        "keywords": []
    },
    {
        "id": "89",
        "content": "The electrical signal in the primary coil is converted into a magnetic field in the transformer's core. When the electrical current through the primary reverses, it causes the established magnetic field to collapse. The collapsing magnetic field then induces an electric field in the secondary winding.",
        "keywords": []
    },
    {
        "id": "90",
        "content": "Sometimes a counterpoise is combined with an ordinary ground, with the buried radial ground cables brought above ground near the base of the antenna to form a counterpoise. The area of the counterpoise around the base of the antenna is often covered with copper screening, to shield the ground to reduce ground currents.",
        "keywords": [
            "antenna",
            "time"
        ]
    },
    {
        "id": "91",
        "content": "Since in an impedance matched transmitter, the transmitter's source resistance is equal to the antenna load resistance, and both are in series in the feedline and consume equal power, the maximum power that can be delivered to the antenna is 50% of the transmitter's output power; the other 50% is dissipated as heat in the transmitter's output stage resistance.",
        "keywords": [
            "antenna"
        ]
    },
    {
        "id": "92",
        "content": "In a C-band antenna setup, the transmission frequencies are typically 3.7–4.2 GHz. By using a local oscillator frequency of 5.150 GHz the IF will be 950–1,450 MHz which is, again, in the receiver's IF tuning range.",
        "keywords": [
            "antenna"
        ]
    },
    {
        "id": "93",
        "content": "Antenna tuners are used almost universally with transmitters. Without an ATU, in addition to reducing the power radiated by the antenna, the reflected current can overheat transformer cores and cause signal distortion. In high-power transmitters it may overheat the transmitter's output amplifier. When reflected power is detected, self-protection circuits in modern transmitters automatically reduce power to safe levels, hence reduce the power of the signal leaving the antenna even further.",
        "keywords": [
            "antenna"
        ]
    },
    {
        "id": "94",
        "content": "In the Unix operating system, most types of input and output operations are considered to be streams of bytes read from a device or written to a device.  This stream of bytes model is used for file I/O, socket I/O, and terminal I/O in order to provide device independence. In order to read and write to a device at the application level, the program calls a function to open the device, which may be a real device such as a terminal or a virtual device such as a network port or a file in a file system. The device's physical characteristics are mediated by the operating system which in turn presents an abstract interface that allows the programmer to read and write bytes from/to the device. The operating system then performs the actual transformation needed to read and write the stream of bytes to the device.",
        "keywords": [
            "network",
            "system",
            "port",
            "device"
        ]
    },
    {
        "id": "95",
        "content": "The conceptualization of knowledge in \"Gopher space\" or a \"cloud\" as specific information in a particular file, and the prominence of the FTP, influenced the technology and the resulting functionality of Gopher.",
        "keywords": [
            "technology"
        ]
    },
    {
        "id": "96",
        "content": "The announcement interval is cooperatively modulated such that all SAP announcements in the multicast delivery scope, by default, consume 4000 bits per second. Regardless, the maximum announce interval is 300 seconds (5 minutes). Announcements automatically expire after 10 times the announcement interval or one hour, whichever is greater. Announcements may also be explicitly withdrawn by the original issuer.",
        "keywords": [
            "time"
        ]
    },
    {
        "id": "97",
        "content": "SPDY is effectively a tunnel for the HTTP and HTTPS protocols. When sent over SPDY, HTTP requests are processed, tokenized, simplified and compressed. For example, each SPDY endpoint keeps track of which headers have been sent in past requests and can avoid resending the headers that have not changed; those that must be sent are compressed.",
        "keywords": [
            "protocol",
            "HTTP"
        ]
    },
    {
        "id": "98",
        "content": "Novell was largely responsible for the use of IPX as a popular computer networking protocol due to their dominance in the network operating system software market (with Novell Netware) from the late 1980s through the mid-1990s.",
        "keywords": [
            "network",
            "IP",
            "protocol",
            "system",
            "computer",
            "software"
        ]
    },
    {
        "id": "99",
        "content": "Name Binding Protocol was a dynamic, distributed system for managing AppleTalk names. When a service started up on a machine, it registered a name for itself as chosen by a human administrator. At this point, NBP provided a system for checking that no other machine had already registered the same name. Later, when a client wanted to access that service, it used NBP to query machines to find that service. NBP provided browseability (\"what are the names of all the services available?\") as well as the ability to find a service with a particular name. Names were human readable, containing spaces, upper and lower case letters, and including support for searching.",
        "keywords": [
            "system",
            "service",
            "port",
            "client"
        ]
    },
    {
        "id": "100",
        "content": "For a brief period, the specification also included a connectionless datagram service, but this was dropped in the next revision. The \"fast select with restricted response facility\" is intermediate between full call establishment and connectionless communication. It is widely used in query-response transaction applications involving a single request and response limited to 128 bytes of data carried each way. The data is carried in an extended call request packet and the response is carried in an extended field of the call reject packet, with a connection never being fully established.",
        "keywords": [
            "data",
            "packet",
            "communication",
            "service",
            "connection"
        ]
    },
    {
        "id": "101",
        "content": "The frame header contains the source and destination addresses that indicate which device originated the frame and which device is expected to receive and process it.  In contrast to the hierarchical and routable addresses of the network layer, layer 2 addresses are flat, meaning that no part of the address can be used to identify the logical or physical group to which the address belongs.",
        "keywords": [
            "network",
            "device"
        ]
    },
    {
        "id": "102",
        "content": "If a speech signal is reduced to packets, and it is forced to share a link with bursty data traffic (traffic with an abnormally large number of packets over a brief period of time, such as could occur during a large scale emergency and the cellular network has become oversubscribed) then no matter how small the speech packets could be made, they would always encounter full-size data packets. Under normal queuing conditions the cells might experience maximum queuing delays. To avoid this issue, all ATM packets, or \"cells,\" are the same small size. In addition, the fixed cell structure means that ATM can be readily switched by hardware without the inherent delays introduced by software switched and routed frames.",
        "keywords": [
            "network",
            "data",
            "packet",
            "time",
            "switch",
            "software"
        ]
    },
    {
        "id": "103",
        "content": "The initial perception of NFV was that virtualized capability should be implemented in data centers. This approach works in many – but not all – cases. NFV presumes and emphasizes the widest possible flexibility as to the physical location of the virtualized functions.",
        "keywords": [
            "data"
        ]
    },
    {
        "id": "104",
        "content": "The term \"session\" refers to a communication between two or more parties – in the context of telephony, this would be a call. Each call consists of one or more call signaling message exchanges that control the call, and one or more call media streams which carry the call's audio, video, or other data along with information of call statistics and quality. Together, these streams make up a session. It is the job of a session border controller to exert influence over the data flows of sessions.",
        "keywords": [
            "data",
            "message",
            "communication"
        ]
    },
    {
        "id": "105",
        "content": "In addition to the before mentioned, to configure a terminal server cluster, one needs a load-balancing technology such as Network Load Balancing (NLB) or DNS round robin. A load balancing solution will distribute client connections to each of the terminal servers.",
        "keywords": [
            "server",
            "technology",
            "client",
            "connection"
        ]
    },
    {
        "id": "106",
        "content": "Leif Ekman, professor in Telecommunication, states that \"Carrier grade\" is not a standard or very clearly defined term but, rather, a set of features and qualities that make the product acceptable by a carrier:\nThe feature set that enables the carrier to utilize the business with use of that equipment. High quality and very good MTBF (Some requirements are stated in TR-144 chapter 7.17). Redundancy (if one part goes down, there is an alternative). Easy and cost-efficient O&M. All Standardized as much as possible",
        "keywords": [
            "communication"
        ]
    },
    {
        "id": "107",
        "content": "For digital-only designs, however, \"standard-cell\" cell libraries, together with modern CAD systems, can offer considerable performance/cost benefits with low risk. Automated layout tools are quick and easy to use and also offer the possibility to \"hand-tweak\" or manually optimize any performance-limiting aspect of the design.",
        "keywords": [
            "system"
        ]
    },
    {
        "id": "108",
        "content": "Google Talk was integrated into Gmail where users could send instant messages to other Gmail users. As it worked within a browser, the Google Talk client did not need to be downloaded to send instant messages to Gmail users.",
        "keywords": [
            "message",
            "client"
        ]
    },
    {
        "id": "109",
        "content": "Since the early 1990s, the terms \"white paper\" or \"whitepaper\" have been applied to documents used as marketing or sales tools in business. These white papers are long-form content designed to promote the products or services from a specific company. As a marketing tool, these papers use selected facts and logical arguments to build a case favorable to the company sponsoring the document.",
        "keywords": [
            "service"
        ]
    },
    {
        "id": "110",
        "content": "SDN technology is currently available for industrial control applications that require extremely fast failover, called Operational Technology (OT) Software Defined Networking (SDN).  OT SDN technology is an approach to manage network access control and Ethernet packet delivery on environmentally hardened hardware for critical infrastructure networks. OT SDN abstracts the management of the control plane from the switches centralizing it in the flow controller and applies SDN as the underlay control plane in the switch. The legacy control plane is removed simplifying the switch while centralizing the control plane management. The common control plane standard used in OT SDN is OpenFlow making it interoperable with other SDN solutions with the difference being that OpenFlow is the only control plane in the switch and that the switch retains flows through power cycles and all flows and redundancy are proactively traffic engineered so the switches can perform the forwarding they are configured to perform with or without the flow controller online. OT SDN provides advantages for industrial networks in the form of performance, cybersecurity and situational awareness. Performance advantages are achieved through proactively traffic engineering contingencies using Fast Failover groups in OpenFlow resulting in network healing from link or switch failures in microseconds not milliseconds like spanning tree technology.  Another performance advantage is that loop mitigation is done through traffic engineered path planning and not blocked ports allowing the system owner to actively use all ports. Cybersecurity advantages of OT SDN is that the switches are deny by default and flows are the rules that allow traffic to be forwarded. This provides strong network access control where packets can be inspected from layer 1 through layer 4 of the OSI model at each hop. Legacy control plane security vulnerabilities are removed since the legacy control plane no longer exists. MAC table spoofing and BPDU spoofing are no longer possible because neither exist in the OT SDN switches. Pivoting and network reconnaissance no longer work with proper flow programming as only allowed traffic is approved to be forwarded combining the physical location and path with the virtual packet filtering. Situational awareness advantages of OT SDN provide the network owner with the visibility to what devices are on their network and what conversations can and are happening and who those conversations can happen between.  OT SDN network technology allows Ethernet networks to meet the demanding communication message exchange requirements of measurement and control for critical infrastructure and simply provides the system owner control over what devices can connect to the network, where those devices can connect, and what conversations each device can have.",
        "keywords": [
            "network",
            "packet",
            "system",
            "message",
            "SDN",
            "communication",
            "security",
            "technology",
            "port",
            "device",
            "switch"
        ]
    },
    {
        "id": "111",
        "content": "ETSI’s standardization activities are organized around sectors: Home & Office, Better Living with ICT, Content Delivery, Networks, Wireless Systems, Transportation, Connecting Things, Interoperability, Public Safety and Security. Technical activities are carried out in the different ETSI technical groups (Technical Committee (TC), ETSI Project (EP), ETSI Partnership Project (EPP), Industry Specification Group (ISG), and Special Committee (SC).",
        "keywords": [
            "port"
        ]
    },
    {
        "id": "112",
        "content": "The Willis Tower (formerly named Sears Tower) is a popular destination for tourists. The Willis Tower has an observation deck open to tourists year round with high up views overlooking Chicago and Lake Michigan. The observation deck includes an enclosed glass balcony that extends 10 feet (3 m) out on the side of the building. Tourists are able to look straight down.",
        "keywords": []
    },
    {
        "id": "113",
        "content": "The units used are seconds. An older common TTL value for DNS was 86400 seconds, which is 24 hours. A TTL value of 86400 would mean that, if a DNS record was changed on the authoritative nameserver, DNS servers around the world could still be showing the old value from their cache for up to 24 hours after the last update by client.",
        "keywords": [
            "server",
            "client"
        ]
    },
    {
        "id": "114",
        "content": "\"In a general way, we can define computing to mean any goal-oriented activity requiring, benefiting from, or creating computers. Thus, computing includes designing and building hardware and software systems for a wide range of purposes; processing, structuring, and managing various kinds of information; doing scientific studies using computers; making computer systems behave intelligently; creating and using communications and entertainment media; finding and gathering information relevant to any particular purpose, and so on. The list is virtually endless, and the possibilities are vast.\"",
        "keywords": [
            "system",
            "communication",
            "computer",
            "software"
        ]
    },
    {
        "id": "115",
        "content": "The alternative situation, when the cache is checked and found not to contain any entry with the desired tag, is known as a cache miss. This requires a more expensive access of data from the backing store. Once the requested data is retrieved, it is typically copied into the cache, ready for the next access.",
        "keywords": [
            "data"
        ]
    },
    {
        "id": "116",
        "content": "Other types of records simply provide some types of information (for example, an HINFO record gives a description of the type of computer/OS a host uses), or others return data used in experimental features. The \"type\" field is also used in the protocol for various operations.",
        "keywords": [
            "data",
            "protocol",
            "computer"
        ]
    },
    {
        "id": "117",
        "content": "Between 1991 and 1994, the simplicity and effectiveness of early technologies used to surf and exchange data through the World Wide Web helped to port them to many different operating systems and spread their use among scientific organizations and universities, and subsequently to the industry.",
        "keywords": [
            "data",
            "system",
            "port"
        ]
    },
    {
        "id": "118",
        "content": "The request that a resource should not be cached is no guarantee that it will not be written to disk.  In particular, the HTTP/1.1 definition draws a distinction between history stores and caches.  If the user navigates back to a previous page a browser may still show you a page that has been stored on disk in the history store. This is correct behavior according to the specification.  Many user agents show different behavior in loading pages from the history store or cache depending on whether the protocol is HTTP or HTTPS.",
        "keywords": [
            "protocol",
            "HTTP"
        ]
    },
    {
        "id": "119",
        "content": "At this time, advertising companies were already using third-party cookies. The recommendation about third-party cookies of RFC 2109 was not followed by Netscape and Internet Explorer. RFC 2109 was superseded by RFC 2965 in October 2000.",
        "keywords": [
            "Internet",
            "time"
        ]
    },
    {
        "id": "120",
        "content": "A category page can be edited like any other page. However, when it is displayed, the editable part of the page is followed by automatically generated lists of pages belonging to the category, as follows:",
        "keywords": []
    },
    {
        "id": "121",
        "content": "Because the lead will usually repeat information also in the body, editors should balance the desire to avoid redundant citations in the lead with the desire to aid readers in locating sources. Leads are usually written at a greater level of generality than the body, and information in the lead section of non-controversial subjects is less likely to be challenged and less likely to require a source. There is not, however, an exception to citation requirements specific to leads. Complex, current, or controversial subjects may require many citations; others, few or none. Contentious material about living persons must be cited every time, regardless of the level of generality.",
        "keywords": [
            "time"
        ]
    },
    {
        "id": "122",
        "content": "State control is also evident in the increasing politicization of regulatory bodies operationalized through transfers and appointments of party-aligned individuals  to senior positions in regulatory authorities.",
        "keywords": []
    },
    {
        "id": "123",
        "content": "Electromagnetic radiation interacts with matter in different ways across the spectrum. These types of interaction are so different that historically different names have been applied to different parts of the spectrum, as though these were different types of radiation. Thus, although these \"different kinds\" of electromagnetic radiation form a quantitatively continuous spectrum of frequencies and wavelengths, the spectrum remains divided for practical reasons related to these qualitative interaction differences.",
        "keywords": []
    },
    {
        "id": "124",
        "content": "People who weren't around in the Twenties when radio exploded can't know what it meant, this milestone for mankind. Suddenly, with radio, there was instant human communication. No longer were our homes isolated and lonely and silent. The world came into our homes for the first time. Music came pouring in. Laughter came in. News came in. The world shrank, with radio.",
        "keywords": [
            "communication",
            "time"
        ]
    },
    {
        "id": "125",
        "content": "At the same time the DC voltage across the line causes a DC current which is split between the resistor-coil (A8-A3) branch and the microphone-coil (A2-A3) branch. The DC current through the resistor-coil branch has no effect on the incoming audio signal. But the DC current passing through the microphone is turned into AC (in response to voice sounds) which then passes through only the upper branch of the coil's (A3) primary winding, which has far fewer turns than the lower primary winding. This causes a small portion of the microphone output to be fed back to the speaker, while the rest of the AC goes out through the phone line.",
        "keywords": [
            "port",
            "time"
        ]
    },
    {
        "id": "126",
        "content": "Optical telegraph lines were installed by governments, often for a military purpose, and reserved for official use only.  In many countries, this situation continued after the introduction of the electric telegraph.  Starting in Germany and the UK, electric telegraph lines were installed by railway companies.  Railway use quickly led to private telegraph companies in the UK and the US offering a telegraph service to the public using telegraph along railway lines.  The availability of this new form of communication brought on widespread social and economic changes.",
        "keywords": [
            "communication",
            "service"
        ]
    },
    {
        "id": "127",
        "content": "Once tuners that could receive select mid-band and super-band channels began to be incorporated into standard television sets, broadcasters were forced to either install scrambling circuitry or move these signals further out of the range of reception for early cable-ready TVs and VCRs. However, once consumer sets had the ability to receive all 181 FCC allocated channels, premium broadcasters were left with no choice but to scramble.",
        "keywords": []
    },
    {
        "id": "128",
        "content": "Public broadcasters in each jurisdiction may or may not be synonymous with government controlled broadcasters. In some countries like the UK public broadcasters are not sanctioned by government departments and have independent means of funding, and thus enjoy editorial independence.",
        "keywords": []
    },
    {
        "id": "129",
        "content": "Bangladesh NGOs Network for Radio and Communication (BNNRC) has been struggling for the last 12 years to open up the community media (including Community Radio, Community Television and Community film) and giving focus on its vital role as voices of the voiceless people. BNNRC has been addressing the community radio & community TV access issue for over a decade, almost since its emergence in the year 2000.",
        "keywords": []
    },
    {
        "id": "130",
        "content": "Public broadcasters in each jurisdiction may or may not be synonymous with government controlled broadcasters. In some countries like the UK public broadcasters are not sanctioned by government departments and have independent means of funding, and thus enjoy editorial independence.",
        "keywords": []
    },
    {
        "id": "131",
        "content": "The original FCC output power limitation for CB radios was \"5 watts DC input to the final amplifier stage\", which was a reference to the earlier radios equipped with tubes.  With solid state radios becoming more common in the 1970s, the FCC revised this specification at the same time the authorized channels were increased to 40. The current specification is simply \"4 watts output (AM) or 12 watts output (SSB)\" as measured at the antenna connector on the back of the radio. The old specification was often used in false advertising by some manufacturers who would claim their CB radios had \"5 watts\" long after the specification had changed to 4 watts output. The older 23 channel radios built under the old specifications typically had an output of around 3.5 to 3.8 watts output when measured at the antenna connector. The FCC simply rounded up the old \"5 watts DC input to the final amplifier stage\" specification to the new \"4 watts output as measured at the antenna connector on the back of the radio\", resulting in a far simpler and easier specification.",
        "keywords": [
            "antenna",
            "time"
        ]
    },
    {
        "id": "132",
        "content": "The success of analogue terrestrial television across Europe varied from country to country. Although each country had rights to a certain number of frequencies by virtue of the ST61 plan, not all of them were brought into service.",
        "keywords": [
            "service"
        ]
    },
    {
        "id": "133",
        "content": "This system has several variations. For example, an organisation's SMTP server may only provide service to users on the same network, enforcing this by firewalling to block access by users on the wider Internet. Or the server may perform range checks on the client's IP address. These methods were typically used by corporations and institutions such as universities which provided an SMTP server for outbound mail only for use internally within the organisation. However, most of these bodies now use client authentication methods, as described below.",
        "keywords": [
            "network",
            "IP",
            "server",
            "system",
            "Internet",
            "service",
            "client"
        ]
    },
    {
        "id": "134",
        "content": "Emails are stored in the user's mailbox on the remote server until the user's email client requests them to be downloaded to the user's computer, or can otherwise access the user's mailbox on the possibly remote server. The email client can be set up to connect to multiple mailboxes at the same time and to request the download of emails either automatically, such as at pre-set intervals, or the request can be manually initiated by the user.",
        "keywords": [
            "server",
            "client",
            "time",
            "computer"
        ]
    },
    {
        "id": "135",
        "content": "In RFC 3, which first defined the RFC series, Crocker started attributing the RFC series to the Network Working Group. Rather than being a formal committee, it was a loose association of researchers interested in the ARPANET project. In effect, it included anyone who wanted to join the meetings and discussions about the project.",
        "keywords": []
    },
    {
        "id": "136",
        "content": "OpenPGP provides a way for the end users to encrypt the email without any support from the server and be sure that only the intended recipient can read it. However, there are usability issues with OpenPGP — it requires users to set up public/private key pairs and make the public keys available widely. Also, it protects only the content of the email, and not metadata — an untrusted party can still observe who sent an email to whom. A general downside of end to end encryption schemes—where the server does not have decryption keys—is that it makes server side search almost impossible, thus impacting usability.",
        "keywords": [
            "data",
            "server",
            "port"
        ]
    },
    {
        "id": "137",
        "content": "IANA is responsible for the global coordination of the DNS root, IP addressing, and other protocol resources. This includes the registration of commonly used port numbers for well-known internet services.",
        "keywords": [
            "IP",
            "protocol",
            "service",
            "port"
        ]
    },
    {
        "id": "138",
        "content": "Separating the civil and military networks reduced the 113-node ARPANET by 68 nodes. After MILNET was split away, the ARPANET would continue be used as an Internet backbone for researchers, but be slowly phased out.",
        "keywords": [
            "network",
            "Internet"
        ]
    },
    {
        "id": "139",
        "content": "In early 2004, BBN applied its acoustics expertise to design, develop, and deliver the Boomerang shooter detection system in a little over two months to combat the sniper threat US troops faced in Operation Iraqi Freedom. The system immediately pinpoints the location of hostile fire. Since then, more than 11,000 Boomerang systems have been deployed by U.S. and allied forces.",
        "keywords": [
            "system"
        ]
    },
    {
        "id": "140",
        "content": "BBN nevertheless went ahead with its purchase of several PDP-10s, and decided to build their own hardware pager. During this period a debate began on what operating system to run on the new machines. Strong arguments were made for the continued use of TOPS-10, in order to keep their existing software running with minimum effort. This would require a re-write of TOPS to support the paging system, and this seemed like a major problem. At the same time, TOPS did not support a number of features the developers wanted. In the end they decided to make a new system, but include an emulation library that would allow it to run existing TOPS-10 software with minor effort.",
        "keywords": [
            "system",
            "port",
            "time",
            "software"
        ]
    },
    {
        "id": "141",
        "content": "ICANN and the Department of Commerce made an agreement for the \"joint development of the \"mechanisms methods, and procedures necessary to effect the transition of Internet domain name and addressing system (DNS) to the private sector\" via a \"Joint Project Agreement\" in 1998.",
        "keywords": [
            "system",
            "Internet"
        ]
    },
    {
        "id": "142",
        "content": "Store and forward switching centers are usually implemented in mobile service stations where the messages that are sent from the sender is first sent to these centers. If the destination address isn't available, then the center stores this message and tries sending it later. This improves the probability of the message to be delivered.  In the other case, if the destination is available at that time, then the message is immediately sent.",
        "keywords": [
            "message",
            "service",
            "time",
            "switch"
        ]
    },
    {
        "id": "143",
        "content": "Creating a new group in the alt.* hierarchy is not subject to the same rules; anybody can create a newsgroup, and anybody can remove it, but most news administrators will ignore these requests unless a local user requests the group by name.",
        "keywords": []
    },
    {
        "id": "144",
        "content": "Sendmail originated in the early days of the Internet, an era when considerations of security did not play a primary role in the development of network software. Early versions of Sendmail suffered from a number of security vulnerabilities that have been corrected over the years.",
        "keywords": [
            "network",
            "Internet",
            "security",
            "software"
        ]
    },
    {
        "id": "145",
        "content": "Alice, believing this public key to be Bob's, encrypts her message with Mallory's key and sends the enciphered message back to Bob. Mallory again intercepts, deciphers the message using her private key, possibly alters it if she wants, and re-enciphers it using the public key she intercepted from Bob when he originally tried to send it to Alice. When Bob receives the newly enciphered message, he believes it came from Alice.",
        "keywords": [
            "message"
        ]
    },
    {
        "id": "146",
        "content": "The literature presents numerous analogies between computer communication and programming. In analogy, a transfer mechanism of a protocol is comparable to a central processing unit (CPU). The framework introduces rules that allow the programmer to design cooperating protocols independently of one another.",
        "keywords": [
            "protocol",
            "communication",
            "computer"
        ]
    },
    {
        "id": "147",
        "content": "Emails are stored in the user's mailbox on the remote server until the user's email client requests them to be downloaded to the user's computer, or can otherwise access the user's mailbox on the possibly remote server. The email client can be set up to connect to multiple mailboxes at the same time and to request the download of emails either automatically, such as at pre-set intervals, or the request can be manually initiated by the user.",
        "keywords": [
            "server",
            "client",
            "time",
            "computer"
        ]
    },
    {
        "id": "148",
        "content": "With many communications taking place over long distance and mediated by technology, and increasing awareness of the importance of interception issues, technology and its compromise are at the heart of this debate. For this reason, this article focuses on communications mediated or intercepted by technology.",
        "keywords": [
            "communication",
            "technology",
            "port"
        ]
    },
    {
        "id": "149",
        "content": "IANA is responsible for the global coordination of the DNS root, IP addressing, and other protocol resources. This includes the registration of commonly used port numbers for well-known internet services.",
        "keywords": [
            "IP",
            "protocol",
            "service",
            "port"
        ]
    },
    {
        "id": "150",
        "content": "When a client may connect to any server in a cluster of servers, a special problem is encountered in maintaining consistency when the servers must maintain session state.  The client must either be directed to the same server for the duration of the session, or the servers must transmit server-side session information via a shared file system or database.  Otherwise, the client may reconnect to a different server than the one it started the session with, which will cause problems when the new server does not have access to the stored state of the old one.",
        "keywords": [
            "data",
            "server",
            "system",
            "client"
        ]
    },
    {
        "id": "151",
        "content": "The original concept of Project Athena was that there would be course-specific software developed to use in conjunction with teaching.  Today, computers are most frequently used for \"horizontal\" applications such as e-mail, word processing, communications, and graphics.",
        "keywords": [
            "communication",
            "computer",
            "software"
        ]
    },
    {
        "id": "152",
        "content": "Neuman and John Kohl published version 5 in 1993 with the intention of overcoming existing limitations and security problems.  Version 5 appeared as RFC 1510, which was then made obsolete by RFC 4120 in 2005.",
        "keywords": [
            "security"
        ]
    },
    {
        "id": "153",
        "content": "Clearly an adversary who can eavesdrop on a password authentication can then authenticate itself in the same way. One solution is to issue multiple passwords, each of them marked with an identifier.  The verifier can ask for any of the passwords, and the prover must have that correct password for that identifier. Assuming that the passwords are chosen independently, an adversary who intercepts one challenge–response message pair has no clues to help with a different challenge at a different time.",
        "keywords": [
            "message",
            "time"
        ]
    },
    {
        "id": "154",
        "content": "As it is easy to generate MD5 collisions, it is possible for the person who created the file to create a second file with the same checksum, so this technique cannot protect against some forms of malicious tampering. In some cases, the checksum cannot be trusted (for example, if it was obtained over the same channel as the downloaded file), in which case MD5 can only provide error-checking functionality: it will recognize a corrupt or incomplete download, which becomes more likely when downloading larger files.",
        "keywords": []
    },
    {
        "id": "155",
        "content": "Opera Mail uses one database that keeps an index of all mail and sorts the messages automatically into several \"views\" or access points. Messages are automatically sorted by types, such as mailing lists, and mail with attachments. This approach to indexing allows for quicker access to messages. For instance, a message sent to a mailing list with a word document attached will appear in both the \"Documents\" attachment view and in the \"Mailing lists\" view. Opera Mail can also use Bayesian filtering to automatically sort messages into other views. All messages in the database are accessed by opening the \"Received\" view.",
        "keywords": [
            "data",
            "message"
        ]
    },
    {
        "id": "156",
        "content": "The initial groupware container application was written in an afternoon by Matthias Hölzer-Klüpfel and later imported into the KDE source repository and maintained by Daniel Molkentin. This container application is essential for Kontact to operate, but without embedded components it is not useful by itself.",
        "keywords": [
            "port"
        ]
    },
    {
        "id": "157",
        "content": "Pending changes are visible in the page history, where they are marked as pending review. The latest accepted revision is displayed to the general public, while logged-in users see the latest revision of the page, with all changes applied.  When editors who are not reviewers make changes to an article with unreviewed pending changes, their edits are also marked as pending and are not visible to most readers.",
        "keywords": []
    },
    {
        "id": "158",
        "content": "The organization tries to foster compatibility and agreement among industry members in the adoption of new standards defined by the W3C. Incompatible versions of HTML are offered by different vendors, causing inconsistency in how web pages are displayed. The consortium tries to get all those vendors to implement a set of core principles and components that are chosen by the consortium.",
        "keywords": []
    },
    {
        "id": "159",
        "content": "The protocol that was created by Google and taken to the IETF under the name QUIC (already in 2012 around QUIC version 20) is quite different from the QUIC that has continued to evolve and be refined within the IETF. The original Google QUIC was designed to be a general purpose protocol, though it was initially deployed as a protocol to support HTTP(S) in Chromium, while the current evolution of the IETF protocol QUIC is the general purpose transport protocol. Chromium developers continued to track the evolution of IETF QUIC's standardization efforts to adopt and fully comply with the most recent internet standards for QUIC in Chromium.",
        "keywords": [
            "protocol",
            "port",
            "HTTP"
        ]
    },
    {
        "id": "160",
        "content": "The request that a resource should not be cached is no guarantee that it will not be written to disk.  In particular, the HTTP/1.1 definition draws a distinction between history stores and caches.  If the user navigates back to a previous page a browser may still show you a page that has been stored on disk in the history store. This is correct behavior according to the specification.  Many user agents show different behavior in loading pages from the history store or cache depending on whether the protocol is HTTP or HTTPS.",
        "keywords": [
            "protocol",
            "HTTP"
        ]
    },
    {
        "id": "161",
        "content": "At this time, advertising companies were already using third-party cookies. The recommendation about third-party cookies of RFC 2109 was not followed by Netscape and Internet Explorer. RFC 2109 was superseded by RFC 2965 in October 2000.",
        "keywords": [
            "Internet",
            "time"
        ]
    },
    {
        "id": "162",
        "content": "The use of ETags in the HTTP header is optional (not mandatory as with some other fields of the HTTP 1.1 header). The method by which ETags are generated has never been specified in the HTTP specification.",
        "keywords": [
            "HTTP"
        ]
    },
    {
        "id": "163",
        "content": "where the value is a comma+space separated list of IP addresses, the left-most being the original client, and each successive proxy that passed the request adding the IP address where it received the request from. In this example, the request passed through proxy1, proxy2, and then proxy3 (not shown in the header). proxy3 appears as remote address of the request.",
        "keywords": [
            "IP",
            "client"
        ]
    },
    {
        "id": "164",
        "content": "All HTTP response status codes are separated into five classes or categories. The first digit of the status code defines the class of response, while the last two digits do not have any classifying or categorization role. There are five classes defined by the standard:",
        "keywords": [
            "HTTP"
        ]
    },
    {
        "id": "165",
        "content": "According to RFC 7231, which obsoletes RFC 2616, \"A 303 response to a GET request indicates that the origin server does not have a representation of the target resource that can be transferred by the server over HTTP. However, the Location field value refers to a resource that is descriptive of the target resource, such that making a retrieval request on that other resource might result in a representation that is useful to recipients without implying that it represents the original target resource.\"",
        "keywords": [
            "server",
            "HTTP"
        ]
    },
    {
        "id": "166",
        "content": "HTTP 403 provides a distinct error case from HTTP 401; while HTTP 401 is returned when the client has not authenticated, and implies that a successful response may be returned following valid authentication, HTTP 403 is returned when the client is not permitted access to the resource despite providing authentication such as insufficient permissions of the authenticated account.",
        "keywords": [
            "client",
            "HTTP"
        ]
    },
    {
        "id": "167",
        "content": "Network address and port translation may be implemented in several ways. Some applications that use IP address information may need to determine the external address of a network address translator. This is the address that its communication peers in the external network detect.  Furthermore, it may be necessary to examine and categorize the type of mapping in use, for example when it is desired to set up a direct communication path between two clients both of which are behind separate NAT gateways.",
        "keywords": [
            "network",
            "IP",
            "communication",
            "port",
            "client"
        ]
    },
    {
        "id": "168",
        "content": "While the primary reason for IPv4 address exhaustion is insufficient capacity in the design of the original Internet infrastructure, several additional driving factors have aggravated the shortcomings. Each of them increased the demand on the limited supply of addresses, often in ways unanticipated by the original designers of the network.",
        "keywords": [
            "network",
            "IP",
            "Internet"
        ]
    },
    {
        "id": "169",
        "content": "In 1975, a two-network TCP/IP communications test was performed between Stanford and University College London. In November 1977, a three-network TCP/IP test was conducted between sites in the US, the UK, and Norway. Several other TCP/IP prototypes were developed at multiple research centers between 1978 and 1983.",
        "keywords": [
            "network",
            "IP",
            "communication"
        ]
    },
    {
        "id": "170",
        "content": "In 1975, a two-network TCP/IP communications test was performed between Stanford and University College London. In November 1977, a three-network TCP/IP test was conducted between sites in the US, the UK, and Norway. Several other TCP/IP prototypes were developed at multiple research centers between 1978 and 1983.",
        "keywords": [
            "network",
            "IP",
            "communication"
        ]
    },
    {
        "id": "171",
        "content": "When configuring port forwarding, the network administrator sets aside one port number on the gateway for the exclusive use of communicating with a service in the private network, located on a specific host. External hosts must know this port number and the address of the gateway to communicate with the network-internal service. Often, the port numbers of well-known Internet services, such as port number 80 for web services (HTTP), are used in port forwarding, so that common Internet services may be implemented on hosts within private networks.",
        "keywords": [
            "network",
            "Internet",
            "service",
            "port",
            "HTTP"
        ]
    },
    {
        "id": "172",
        "content": "Between 1991 and 1994, the simplicity and effectiveness of early technologies used to surf and exchange data through the World Wide Web helped to port them to many different operating systems and spread their use among scientific organizations and universities, and subsequently to the industry.",
        "keywords": [
            "data",
            "system",
            "port"
        ]
    },
    {
        "id": "173",
        "content": "This system has several variations. For example, an organisation's SMTP server may only provide service to users on the same network, enforcing this by firewalling to block access by users on the wider Internet. Or the server may perform range checks on the client's IP address. These methods were typically used by corporations and institutions such as universities which provided an SMTP server for outbound mail only for use internally within the organisation. However, most of these bodies now use client authentication methods, as described below.",
        "keywords": [
            "network",
            "IP",
            "server",
            "system",
            "Internet",
            "service",
            "client"
        ]
    },
    {
        "id": "174",
        "content": "In each step of this sequence of client–server message exchanges, a computer processes a request and returns data. This is the request-response messaging pattern. When all the requests are met, the sequence is complete and the web browser presents the data to the customer.",
        "keywords": [
            "data",
            "server",
            "message",
            "client",
            "computer"
        ]
    },
    {
        "id": "175",
        "content": "The efficiency of load balancing algorithms critically depends on the nature of the tasks. Therefore, the more information about the tasks is available at the time of decision making, the greater the potential for optimization.",
        "keywords": [
            "time"
        ]
    },
    {
        "id": "176",
        "content": "Networking devices includes a broad range of equipment which can be classified as core network components which interconnect other network components, hybrid components which can be found in the core or border of a network and hardware or software components which typically sit on the connection point of different networks.",
        "keywords": [
            "network",
            "connection",
            "device",
            "software"
        ]
    },
    {
        "id": "177",
        "content": "In 1975, a two-network TCP/IP communications test was performed between Stanford and University College London. In November 1977, a three-network TCP/IP test was conducted between sites in the US, the UK, and Norway. Several other TCP/IP prototypes were developed at multiple research centers between 1978 and 1983.",
        "keywords": [
            "network",
            "IP",
            "communication"
        ]
    },
    {
        "id": "178",
        "content": "The primary function of a router is to forward a packet toward its destination network, which is the destination IP address of the packet. To do this, a router needs to search the routing information stored in its routing table. The routing table contains network/next hop associations. These associations tell a router that a particular destination can be optimally reached by sending the packet to a specific router that represents the next hop on the way to the final destination. The next hop association can also be the outgoing or exit interface to the final destination.",
        "keywords": [
            "network",
            "IP",
            "packet"
        ]
    },
    {
        "id": "179",
        "content": "Fibers have many uses in remote sensing. In some applications, the sensor is itself an optical fiber. Fibers are used to channel radiation to a sensor where it is measured. In other cases, fiber is used to connect a sensor to a measurement system.",
        "keywords": [
            "system"
        ]
    },
    {
        "id": "180",
        "content": "Switches learn the port on which they first saw a particular source address and associate that port with that address. When the bridge subsequently receives a frame with a destination address in its FIB, it sends the frame out the port stored in the FIB entry.",
        "keywords": [
            "port"
        ]
    },
    {
        "id": "181",
        "content": "In certain cases the table may specify that a packet is to be discarded. In such cases, the router may return an ICMP \"destination unreachable\" or other appropriate code. Some security policies, however, dictate that the router should drop the packet silently, in order that a potential attacker does not become aware that a target is being protected.",
        "keywords": [
            "packet",
            "ICMP",
            "security"
        ]
    },
    {
        "id": "182",
        "content": "Many countries initially used different specifications for connectors, and some national connector types remain in service, but few are used for new installations for which modular connector types are prescribed.",
        "keywords": [
            "service"
        ]
    },
    {
        "id": "183",
        "content": "Vendors may support usage of higher frequencies as a proprietary extension to the standard. However, this requires matching vendor-supplied equipment on both ends of the line, and will likely result in crosstalk problems that affect other lines in the same bundle.",
        "keywords": [
            "port"
        ]
    },
    {
        "id": "184",
        "content": "The benefits of subnetting an existing network vary with each deployment scenario. In the address allocation architecture of the Internet using CIDR and in large organizations, it is necessary to allocate address space efficiently. Subnetting may also enhance routing efficiency, or have advantages in network management when subnetworks are administratively controlled by different entities in a larger organization.  Subnets may be arranged logically in a hierarchical architecture, partitioning an organization's network address space into a tree-like routing structure, or other structures such as meshes.",
        "keywords": [
            "network",
            "Internet"
        ]
    },
    {
        "id": "185",
        "content": "Early network design, when global end-to-end connectivity was envisioned for communications with all Internet hosts, intended that IP addresses be globally unique. However, it was found that this was not always necessary as private networks developed and public address space needed to be conserved.",
        "keywords": [
            "network",
            "IP",
            "Internet",
            "communication"
        ]
    },
    {
        "id": "186",
        "content": "The CRS Line card chassis comes in three different flavors: 4-slot, 8-slot and 16-slot. The number of slots indicates the number of line cards that the chassis can accommodate. There is only one variety of Fabric card chassis.",
        "keywords": []
    },
    {
        "id": "187",
        "content": "In AC power service, the current periodically passes through zero; this effect makes it harder to sustain an arc on opening. Manufacturers may rate switches with lower voltage or current rating when used in DC circuits.",
        "keywords": [
            "service",
            "switch"
        ]
    },
    {
        "id": "188",
        "content": "The introduction of the NEC clearly states that it is not intended to be a design manual, and therefore creating a colour code for ungrounded or \"hot\" conductors falls outside the scope and purpose of the NEC. However, it is a common misconception that \"hot\" conductor colour-coding is required by the Code.",
        "keywords": []
    },
    {
        "id": "189",
        "content": "The purpose of the NEC is to protect persons and property from hazards arising from the use of electricity.  The NEC is not any jurisdiction's electrical code per se; rather, it is an influential work of standards that local legislators (e.g., city council members, state legislators, etc. as appropriate) tend to use as a guide when enacting local electrical codes. The NFPA states that excerpts quoted from the National Electrical Code must have a disclaimer indicating that the excerpt is not the complete and authoritative position of the NFPA and that the original NEC document must be consulted as the definitive reference.",
        "keywords": []
    },
    {
        "id": "190",
        "content": "The standard colours in fixed wiring were harmonised in 2004 with the regulations in other European countries and the international IEC 60446 standard. For a transitional period (April 2004 – March 2006) either set of colours were allowed (but not both), provided that any changes in the colour scheme are clearly labelled. From April 2006, only the new colours should be used for any new wiring.",
        "keywords": []
    },
    {
        "id": "191",
        "content": "The first edition was published in 1882 as the \"Rules and Regulations for the Prevention of Fire Risks arising from Electric Lighting.\"  The title became \"General Rules recommended for Wiring for the Supply of Electrical Energy\" with the third edition in 1897, \"Wiring Rules\" with the fifth edition of 1907, and settled at \"Regulations for the Electrical Equipment of Buildings\" with the eighth edition in 1924.",
        "keywords": []
    },
    {
        "id": "192",
        "content": "The Canadian Electrical Code serves as the basis for wiring regulations across Canada. Generally, legislation adopts the Code by reference, usually with a schedule of changes that amend the Code for local conditions. These amendments may be administrative in nature or may consist of technical content particular to the region. Since the Code is a copyrighted document produced by a private body, it may not be distributed without copyright permission from the Canadian Standards Association.",
        "keywords": []
    },
    {
        "id": "193",
        "content": "The NEC is available as a bound book containing approximately 1000 pages. It has been available in electronic form since the 1993 edition. Although the code is updated every three years, some jurisdictions do not immediately adopt the new edition.",
        "keywords": []
    },
    {
        "id": "194",
        "content": "Some multi-standard sockets allow use of several types of plug; improvised or unapproved adaptors between incompatible sockets and plugs may not provide the full safety and performance of an approved socket-plug combination.",
        "keywords": []
    },
    {
        "id": "195",
        "content": "A ventilated tray has openings in the bottom of the tray, allowing some air circulation around the cables, water drainage, and allowing some dust to fall through the tray. Small cables may exit the tray through the ventilation openings, which may be either slots or holes punched in the bottom. A ladder tray has the cables supported by a traverse bar, similarly to the rungs of a ladder, at regular intervals on the order of 4 to 12 inches (100 to 300 mm).",
        "keywords": [
            "port"
        ]
    },
    {
        "id": "196",
        "content": "Electrical conduit provides very good protection to enclosed conductors from impact, moisture, and chemical vapors. Varying numbers, sizes, and types of conductors can be pulled into a conduit, which simplifies design and construction compared to multiple runs of cables or the expense of customized composite cable. Wiring systems in buildings may be subject to frequent alterations. Frequent wiring changes are made simpler and safer through the use of electrical conduit, as existing conductors can be withdrawn and new conductors installed, with little disruption along the path of the conduit.",
        "keywords": [
            "system"
        ]
    },
    {
        "id": "197",
        "content": "Ideally, the ring circuit acts like two radial circuits proceeding in opposite directions around the ring, the dividing point between them dependent on the distribution of load in the ring.  If the load is evenly split across the two directions, the current in each direction is half of the total, allowing the use of wire with half the total current-carrying capacity.  In practice, the load does not always split evenly, so thicker wire is used.",
        "keywords": []
    },
    {
        "id": "198",
        "content": "When installed as the first outlet on a branch circuit, AFCI receptacles provide series arc protection for the entire branch circuit. They also provide parallel arc protection for the branch circuit starting at the AFCI receptacle.  Unlike AFCI breakers, AFCI receptacles may be used on any wiring system regardless of the panel.",
        "keywords": [
            "system"
        ]
    },
    {
        "id": "199",
        "content": "A busbar system usually contains couple of busbar holders, busbars, Adapters to mount devices, clamps either with protective covering or without covering to powerup or distribute the current from the busbar system & busbar mountable electrical devices.",
        "keywords": [
            "system",
            "device"
        ]
    },
    {
        "id": "200",
        "content": "The fuse elements may be shaped to increase heating effect. In large fuses, current may be divided between multiple strips of metal. A dual-element fuse may contain a metal strip that melts instantly on a short circuit, and also contain a low-melting solder joint that responds to long-term overload of low values compared to a short circuit. Fuse elements may be supported by steel or nichrome wires, so that no strain is placed on the element, but a spring may be included to increase the speed of parting of the element fragments.",
        "keywords": [
            "port"
        ]
    },
    {
        "id": "201",
        "content": "A two-pole, or double-pole, residual-current device. The test button and connect/disconnect switch are colored blue. A fault will trigger the switch to its down (off) position, which in this device would disconnect both conductors.",
        "keywords": [
            "device",
            "switch"
        ]
    },
    {
        "id": "202",
        "content": "Breakers are usually arranged in two columns. In a U.S.-style board, breaker positions are numbered left-to-right, along each row from top to bottom. This numbering system is universal with numerous competitive manufacturers of breaker panels.",
        "keywords": [
            "system"
        ]
    },
    {
        "id": "203",
        "content": "The choice of consumer unit will reflect several factors such as the size and layout of the dwelling, number of floors, outbuildings, the expected load levels (ovens, showers, immersion heaters, electric blankets, car-chargers etc.), and how much protection is required for each circuit.",
        "keywords": []
    },
    {
        "id": "204",
        "content": "In most developed countries, 220 V, 230 V, or 240 V sockets with earthed contacts were introduced either just before or soon after World War II, though with considerable national variation. However in the United States and Canada, where the supply voltage is only 120 V power outlets installed before the mid-1960s generally did not include a ground (earth) pin.  In the developing world, local wiring practice may or may not provide a connection to an earth.",
        "keywords": [
            "connection"
        ]
    },
    {
        "id": "205",
        "content": "The TLS protocol aims primarily to provide privacy and data integrity between two or more communicating computer applications. It runs in the application layer of the Internet and is itself composed of two layers: the TLS record and the TLS handshake protocols.",
        "keywords": [
            "data",
            "protocol",
            "Internet",
            "computer"
        ]
    },
    {
        "id": "206",
        "content": "The reversal was complete with the availability of version 1.1 beta on 6 March 1995, in which a press release states that the final 1.1 release would be available at no cost only for academic and non-profit organizational use. Gone was the notion expressed in the first press release that Navigator would be freely available in the spirit of Internet software.",
        "keywords": [
            "Internet",
            "software"
        ]
    },
    {
        "id": "207",
        "content": "IANA is responsible for the global coordination of the DNS root, IP addressing, and other protocol resources. This includes the registration of commonly used port numbers for well-known internet services.",
        "keywords": [
            "IP",
            "protocol",
            "service",
            "port"
        ]
    },
    {
        "id": "208",
        "content": "Symmetric-key algorithms require both the sender and the recipient of a message to have the same secret key.\nAll early cryptographic systems required either the sender or the recipient to somehow receive a copy of that secret key over a physically secure channel.",
        "keywords": [
            "system",
            "message"
        ]
    },
    {
        "id": "209",
        "content": "Encryption is used in the 21st century to protect digital data and information systems. As computing power increased over the years, encryption technology has only become more advanced and secure. However, this advancement in technology has also exposed a potential limitation of today's encryption methods.",
        "keywords": [
            "data",
            "system",
            "technology"
        ]
    },
    {
        "id": "210",
        "content": "A TLS server may be configured with a self-signed certificate. When that is the case, clients will generally be unable to verify the certificate, and will terminate the connection unless certificate checking is disabled.",
        "keywords": [
            "server",
            "client",
            "connection"
        ]
    },
    {
        "id": "211",
        "content": "Worldwide, the certificate authority business is fragmented, with national or regional providers dominating their home market.  This is because many uses of digital certificates, such as for legally binding digital signatures, are linked to local law, regulations, and accreditation schemes for certificate authorities.",
        "keywords": []
    },
    {
        "id": "212",
        "content": "The earliest methods for generating random numbers, such as dice, coin flipping and roulette wheels, are still used today, mainly in games and gambling as they tend to be too slow for most applications in statistics and cryptography.",
        "keywords": []
    },
    {
        "id": "213",
        "content": "Diffie–Hellman key exchange establishes a shared secret between two parties that can be used for secret communication for exchanging data over a public network. An analogy illustrates the concept of public key exchange by using colors instead of very large numbers:",
        "keywords": [
            "network",
            "data",
            "communication"
        ]
    },
    {
        "id": "214",
        "content": "Symmetric-key algorithms require both the sender and the recipient of a message to have the same secret key.\nAll early cryptographic systems required either the sender or the recipient to somehow receive a copy of that secret key over a physically secure channel.",
        "keywords": [
            "system",
            "message"
        ]
    },
    {
        "id": "215",
        "content": "Forward secrecy protects data on the transport layer of a network that uses common SSL/TLS protocols, including OpenSSL, when its long-term secret keys are compromised, as with the Heartbleed security bug. If forward secrecy is used, encrypted communications and sessions recorded in the past cannot be retrieved and decrypted should long-term secret keys or passwords be compromised in the future, even if the adversary actively interfered, for example via a man-in-the-middle attack.",
        "keywords": [
            "network",
            "data",
            "protocol",
            "communication",
            "security",
            "port"
        ]
    },
    {
        "id": "216",
        "content": "Toward the goal of  \"secure network programming for the masses,\" the inventors of SNP conceived secure sockets as a high-level abstraction suitable for securing Internet applications. In 1993, they designed and built a prototype of SNP. Designed as an application sublayer on top of sockets, SNP provides a user interface closely resembling sockets.  This resemblance was by design so that security could be retrofitted into existing socket programs with only minor modifications. Also, with such a sublayer carefully designed and its implementation thoroughly debugged, it can be easily used by any Internet application that uses sockets for end-to-end communications. This is a natural idea in hindsight but, in 1993, it was novel and a major departure from mainstream network security research at that time.",
        "keywords": [
            "network",
            "Internet",
            "communication",
            "security",
            "time"
        ]
    },
    {
        "id": "217",
        "content": "The PCI Council formed a body of security standards known as the Payment Card Industry Data Security Standard (PCI DSS), and these standards consist of twelve significant requirements including multiple sub-requirements, which contain numerous directives against which businesses may measure their own payment card security policies, procedures and guidelines.",
        "keywords": [
            "security"
        ]
    },
    {
        "id": "218",
        "content": "The multiplexed signal is transmitted over a communication channel such as a cable. The multiplexing divides the capacity of the communication channel into several logical channels, one for each message signal or data stream to be transferred. A reverse process, known as demultiplexing, extracts the original channels on the receiver end.",
        "keywords": [
            "data",
            "message",
            "communication"
        ]
    },
    {
        "id": "219",
        "content": "The initial perception of NFV was that virtualized capability should be implemented in data centers. This approach works in many – but not all – cases. NFV presumes and emphasizes the widest possible flexibility as to the physical location of the virtualized functions.",
        "keywords": [
            "data"
        ]
    },
    {
        "id": "220",
        "content": "The initial perception of NFV was that virtualized capability should be implemented in data centers. This approach works in many – but not all – cases. NFV presumes and emphasizes the widest possible flexibility as to the physical location of the virtualized functions.",
        "keywords": [
            "data"
        ]
    },
    {
        "id": "221",
        "content": "Because MVNOs are effectively defined by their lack of spectrum licenses, an MVNO necessarily will need to have agreements in place to access the network of at least one MNO. The type of MVNO is determined by how \"thick\" or \"thin\" a technological layer an MVNO adds over its access to its host MNO's network.",
        "keywords": [
            "network"
        ]
    },
    {
        "id": "222",
        "content": "While the industry has seemingly standardized on VoLTE for the future, the demand for voice calls today has led LTE carriers to introduce circuit-switched fallback as a stopgap measure. When placing or receiving a voice call, LTE handsets will fall back to old 2G or 3G networks for the duration of the call.",
        "keywords": [
            "network",
            "switch"
        ]
    },
    {
        "id": "223",
        "content": "While the ITU has adopted recommendations for technologies that would be used for future global communications, they do not actually perform the standardization or development work themselves, instead relying on the work of other standard bodies such as IEEE, WiMAX Forum, and 3GPP.",
        "keywords": [
            "communication"
        ]
    },
    {
        "id": "224",
        "content": "Machine to machine wireless networks can serve to improve the production and efficiency of machines, to enhance the reliability and safety of complex systems, and to promote the life-cycle management for key assets and products. By applying Prognostic and Health Management (PHM) techniques in machine networks, the following goals can be achieved or improved:",
        "keywords": [
            "network",
            "system"
        ]
    },
    {
        "id": "225",
        "content": "Due to the nearness of the analytical resources to the end users, sophisticated analytical tools and Artificial Intelligence tools can run on the edge of the system. This placement at the edge helps to increase operational efficiency and is responsible for many advantages to the system.",
        "keywords": [
            "system"
        ]
    },
    {
        "id": "226",
        "content": "Virtual retinal display creates images that can be seen in ambient daylight and ambient room light. The VRD is considered a preferred candidate to use in a surgical display due to its combination of high resolution and high contrast and brightness. Additional tests show high potential for VRD to be used as a display technology for patients that have low vision.",
        "keywords": [
            "technology"
        ]
    },
    {
        "id": "227",
        "content": "Another disadvantage is that central computing relies heavily on the quality of administration and resources provided to its users.  Should the central computer be inadequately supported by any means (e.g. size of home directories, problems regarding administration), then your usage will suffer greatly.  The reverse situation, however, (i.e., a system supported better than your needs) is one of the key advantages to centralized computing.",
        "keywords": [
            "system",
            "port",
            "computer"
        ]
    },
    {
        "id": "228",
        "content": "Information security is also a concern, and for this reason, a data center has to offer a secure environment that minimizes the chances of a security breach. A data center must, therefore, keep high standards for assuring the integrity and functionality of its hosted computer environment.",
        "keywords": [
            "data",
            "security",
            "computer"
        ]
    },
    {
        "id": "229",
        "content": "RANAP signalling protocol resides in the control plane of Radio network layer of Iu interface in the UMTS (Universal Mobile Telecommunication System) protocol stack. Iu interface is the interface between RNC (Radio Network Controller) and CN (Core Network). nb. For Iu-ps transport RANAP is carried on SCTP if IP interface used on this.",
        "keywords": [
            "network",
            "IP",
            "protocol",
            "communication",
            "port"
        ]
    },
    {
        "id": "230",
        "content": "Between the 1980s and the 2000s, the mobile phone has gone from being an expensive item used by the business elite to a pervasive,  personal communications tool for the general population. In most countries, mobile phones outnumber land-line phones, with fixed landlines numbering 1.3 billion but mobile subscriptions 3.3 billion at the end of 2007.",
        "keywords": [
            "communication"
        ]
    },
    {
        "id": "231",
        "content": "The first HSPA specifications supported increased peak data rates of up to 14 Mbit/s in the downlink and 5.76 Mbit/s in the uplink. It also reduced latency and provided up to five times more system capacity in the downlink and up to twice as much system capacity in the uplink compared with original WCDMA protocol.",
        "keywords": [
            "data",
            "protocol",
            "system",
            "port",
            "time"
        ]
    },
    {
        "id": "232",
        "content": "The support of MIMO in combination with DC-HSDPA will allow operators deploying Release 7 MIMO to benefit from the DC-HSDPA functionality as defined in Release 8. While in Release 8 DC-HSDPA can only operate on adjacent carriers, Release 9 also allows that the paired cells can operate on two different frequency bands. Later releases allow the use of up to four carriers simultaneously.",
        "keywords": [
            "port"
        ]
    },
    {
        "id": "233",
        "content": "In a primitive taxi system, when the taxi moved away from a first tower and closer to a second tower, the taxi driver manually switched from one frequency to another as needed.  If communication was interrupted due to a loss of a signal, the taxi driver asked the base station operator to repeat the message on a different frequency.",
        "keywords": [
            "system",
            "message",
            "communication",
            "switch"
        ]
    },
    {
        "id": "234",
        "content": "Mobile phones communicate with cell towers that are placed to give coverage across a telephone service area, which is divided up into 'cells'. Each cell uses a different set of frequencies from neighboring cells, and will typically be covered by three towers placed at different locations. The cell towers are usually interconnected to each other and the phone network and the internet by wired connections. Due to bandwidth limitations each cell will have a maximum number of cell phones it can handle at once. The cells are therefore sized depending on the expected usage density, and may be much smaller in cities. In that case much lower transmitter powers are used to avoid broadcasting beyond the cell.",
        "keywords": [
            "network",
            "service",
            "connection"
        ]
    },
    {
        "id": "235",
        "content": "Also known as IIoT, industrial IoT devices acquire and analyze data from connected equipment, operational technology (OT), locations, and people. Combined with operational technology (OT) monitoring devices, IIoT helps regulate and monitor industrial systems. Also, the same implementation can be carried out for automated record updates of asset placement in industrial storage units as the size of the assets can vary from a small screw to the whole motor spare part, and misplacement of such assets can cause a percentile loss of manpower time and money.",
        "keywords": [
            "data",
            "system",
            "technology",
            "time",
            "device"
        ]
    },
    {
        "id": "236",
        "content": "While the industry has seemingly standardized on VoLTE for the future, the demand for voice calls today has led LTE carriers to introduce circuit-switched fallback as a stopgap measure. When placing or receiving a voice call, LTE handsets will fall back to old 2G or 3G networks for the duration of the call.",
        "keywords": [
            "network",
            "switch"
        ]
    },
    {
        "id": "237",
        "content": "Providers of fixed wireless broadband services typically provide equipment to customers and install a small antenna or dish somewhere on the roof. This equipment is usually deployed as a service and maintained by the company providing that service. Fixed wireless services have become particularly popular in many rural areas where cable, DSL or other typical home internet services are not available.",
        "keywords": [
            "antenna",
            "service"
        ]
    },
    {
        "id": "238",
        "content": "Through the introduction of sophisticated methods of coding and transmitting data, EDGE delivers higher bit-rates per radio channel, resulting in a threefold increase in capacity and performance compared with an ordinary GSM/GPRS connection.",
        "keywords": [
            "data",
            "connection"
        ]
    },
    {
        "id": "239",
        "content": "Original standardization work for LTE-Advanced was done as part of 3GPP Release 10, which was frozen in April 2011. Trials were based on pre-release equipment. Major vendors support software upgrades to later versions and ongoing improvements.",
        "keywords": [
            "port",
            "software"
        ]
    },
    {
        "id": "240",
        "content": "Telia Broadband was relaunched in 2008 because of the need for TeliaSonera to offer both mobile and broadband in all of their home markets (Sweden, Norway, Denmark and Finland). Telia Broadband was the first operator to launch digital TV with their broadband at no extra cost. Stofa is mainly a cable TV operator, but also supplies broadband via the cable TV network.",
        "keywords": [
            "network"
        ]
    },
    {
        "id": "241",
        "content": "The ThunderBolt shipped with Android 2.2 (Froyo) and it was later updated in September 2011 to Android 2.3 (Gingerbread).  In early February 2013, the ThunderBolt was updated to Android 4.0.4 (Ice Cream Sandwich) and Sense 3.6.",
        "keywords": []
    },
    {
        "id": "242",
        "content": "ETSI’s standardization activities are organized around sectors: Home & Office, Better Living with ICT, Content Delivery, Networks, Wireless Systems, Transportation, Connecting Things, Interoperability, Public Safety and Security. Technical activities are carried out in the different ETSI technical groups (Technical Committee (TC), ETSI Project (EP), ETSI Partnership Project (EPP), Industry Specification Group (ISG), and Special Committee (SC).",
        "keywords": [
            "port"
        ]
    },
    {
        "id": "243",
        "content": "In addition to wholly owned subsidiaries in Europe and North America, the company is expanding its global reach through strategic alliances with mobile and multimedia service providers in Asia-Pacific and Europe. NTT Docomo is listed on the Tokyo (9437), London (NDCM), and New York (DCM) stock exchanges.",
        "keywords": [
            "service",
            "time"
        ]
    },
    {
        "id": "244",
        "content": "At the beginning of WWII Norway declared itself a neutral state. However, despite their neutral status Germany invaded Norway, assisted by a small pro-Nazi socialist party led by Vidkun Quisling. Oslo was quickly occupied after valiant efforts by the overmatched defenders. Oslo remained occupied throughout the war until the Nazi retreat in 1944. However, the occupying troops were harried by saboteurs and other acts of resistance throughout the occupation.",
        "keywords": []
    }
]
